# Creating Dummy Dataset of bank for Personal Loan product

## Attributes:

- Date_of_dis => Date of loan disbursement
- Customer_id
- First_name
- Last_name
- Gender => (Male, Female)
- Email
- Phone
- Age
- Occupation => Customers occupation
- Income
- Marital_status => (Married, Single, Divorced, Widowed, Seperated)
- Principle_Amount
- Interest_rate
- Processing_fee
- Tenure => (12, 24, 36, 48, 60)months
- EMI
- First_duedate
- Tenure_rem => Tenure Remaining
- Principle_amt_rem => Principle amount remaining
- Last_duedate
- Next_duedate
- Loan_status => (Active, Collection, Sold, Paidoff)
- Loan_purpose => ('Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses')

In [145]:
import pandas as pd
import numpy as np

In [146]:
# Creating 1lac rows od 'Date of credit'

date_range = pd.date_range(start='2018-01-01', end= '2019-12-31', freq='D')
date = list(pd.Series(date_range))
Date_of_cr = np.random.choice(date, 100000)
df = pd.DataFrame(Date_of_cr, columns=['Date_of_cr'])
df['Date_of_cr'] = sorted(df['Date_of_cr'])
df.head()

  Date_of_cr
0 2018-01-01
1 2018-01-01
2 2018-01-01
3 2018-01-01
4 2018-01-01

In [147]:
df.shape

(100000, 1)

In [148]:
# Creating Customer Id data
import random

df['Customer_id'] = sorted(random.sample(range(1000000, 9999999), len(df['Date_of_cr']))) 
df.head()

  Date_of_cr  Customer_id
0 2018-01-01      1000049
1 2018-01-01      1000063
2 2018-01-01      1000080
3 2018-01-01      1000172
4 2018-01-01      1000197

In [149]:
lastname = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Last-Names.csv')


# removing all missing data and non alpha data
l_name=[]

for x in lastname['Last_names']:
  if type(x) == str:
    l_name.append(x)

# taking only the first word of the name
last_name = []

for x in l_name:
  last_name.append(x.split()[0])

In [150]:
len(last_name)

564

In [151]:
# Creating 1 lac names (50k male & 50k female names)

malename = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Male-Names.csv')
# malename = malename.drop(['gender', 'race'], axis=1)

femalename = pd.read_csv('/content/drive/My Drive/Colab Notebooks/iNeuron Project/Indian-Female-Names.csv')
# femalename = femalename.drop(['gender', 'race'], axis=1)

In [152]:
malename['name'] = malename['name'].astype('string') 
malename.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14845 entries, 0 to 14844
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    14821 non-null  string
 1   gender  14845 non-null  object
 2   race    14845 non-null  object
dtypes: object(2), string(1)
memory usage: 348.1+ KB

In [153]:
# removing all missing data and non alpha data
malefirstname=[]
other = []

for x in malename['name']:
  if type(x) == str:
    x = x.replace('@', '').split()[0]
    if x.isalpha():
      malefirstname.append(x)
    else:
      other.append(x)

# -------------------------------------
femalefirstname=[]

for x in femalename['name']:
  if type(x) == str:
    x = x.replace('@', '').split()[0]
    if x.isalpha():
      femalefirstname.append(x)

In [154]:
malefirstname50k = np.random.choice(malefirstname, 50000)
femalefirstname50k = np.random.choice(femalefirstname, 50000)

In [155]:
mgender = []

for x in range(50000):
  mgender.append('Male')


len(mgender)

50000

In [156]:
fgender = []

for x in range(50000):
  fgender.append('Female')


len(fgender)

50000

In [157]:
Mnamedata = pd.DataFrame(list(zip(malefirstname50k, mgender)), columns=['First_name', 'Gender'])
Fnamedata = pd.DataFrame(list(zip(femalefirstname50k, fgender)), columns=['First_name', 'Gender'])

In [158]:
bothname_genderdata = pd.concat([Mnamedata, Fnamedata], axis=0, ignore_index=True)
bothname_genderdata = bothname_genderdata.apply(np.random.permutation, axis=0)   
bothname_genderdata.head(10)

  First_name  Gender
0    gulshan    Male
1   vaijanti  Female
2   karishma  Female
3         km  Female
4      deepa    Male
5      jagan    Male
6       amit  Female
7     rooshi  Female
8     bharti    Male
9      seema  Female

In [159]:
df = pd.concat([df, bothname_genderdata], join='inner', axis=1)

In [160]:
df.head()

  Date_of_cr  Customer_id First_name  Gender
0 2018-01-01      1000049    gulshan    Male
1 2018-01-01      1000063   vaijanti  Female
2 2018-01-01      1000080   karishma  Female
3 2018-01-01      1000172         km  Female
4 2018-01-01      1000197      deepa    Male

In [161]:
df['Last_name'] = np.random.choice(last_name, 100000)

In [162]:
df['First_name'] = df.First_name.str.capitalize()
df['Last_name'] = df.Last_name.str.capitalize()

In [64]:
df = df[['Date_of_cr',	'Customer_id',	'First_name', 'Last_name', 'Gender']]
df.head()

  Date_of_cr  Customer_id First_name Last_name Gender
0 2018-01-01      1000388       Arif     Manda   Male
1 2018-01-01      1000425      Aatif       Das   Male
2 2018-01-01      1000513      Gorav       Sem   Male
3 2018-01-01      1000586    Sandeep    Minhas   Male
4 2018-01-01      1000807       Arun  Mehrotra   Male

In [163]:
# Creating Email
df['Email'] = df.First_name.str.lower() + '.' + df.Last_name.str.lower() + '@dummyemail.com'

In [164]:
# Creating Phone #

df['Phone'] = random.sample(range(7000000000, 9999999999), 100000)

In [165]:
# Creating Age

df['Age'] = np.random.choice(range(25, 55), 100000)

In [166]:
# Creating Occupation

occupation = ['Engineer', 'Teacher', 'Architect', 'Consultant', 'Scientist', 'Software Developer',
              'Lawyer', 'Psychologist', 'Veterinarian', 'Civil Engineer', 'Surveyor', 'Secretary',
              'Broker', 'Train_driver', 'Physician', 'Furniture Designer', 'Aviator', 'Estate agent',
              'Domestic worker', 'Chef', 'Hotel Manager', 'Financial Analyst', 'Political scientist',
              'Author', 'Biomedical Engineer', 'Official', 'Mathematician', 'Loan Officer', 'Machinist',
              'Musician', 'Businessperson', 'Civil servant', 'Tailor', 'Politician', 'Designer', 'Industrial Engineer',
              'Physiotherapist', 'Drafter', 'Rocket scientist', 'Graphic Designer', 'Health professional',
              'Petroleum Engineer', 'Flight attendant', 'Historian', 'Mechanical engineer', 'Flight engineer',
              'Professor', 'Army officer', 'Makeup Artist', 'School counselor', 'Computer operator', 'Govt.Service',
              'Service', 'Self Employed']

df['Occupation'] = np.random.choice(occupation, 100000)

In [167]:
# Creating income column
df['Income'] = np.random.randint(300000, 3000000, 100000)

In [168]:
# Creating maritak status

marital_status = ['Married', 'Divorced', 'Single', 'Widowed', 'Separated']

df['Marital_status'] = np.random.choice(marital_status, 100000, p=[0.6, 0.1, 0.1, 0.1, 0.1])

In [169]:
# Creating Principle Amount

df['Principle_Amount'] = np.random.randint(300, 3000, 100000)
df['Principle_Amount'] = df['Principle_Amount']*1000

In [170]:
# Creating Interest rate

df['Interest_rate'] = np.random.uniform(14, 24, 100000)
df['Interest_rate'] = df['Interest_rate'].round(2)

In [171]:
# Processing fee is 0.35% of the principle amount

df['Processing_fee'] = df['Principle_Amount']*0.35/100

In [172]:
# Tenure
tenure = [12, 24, 36, 48, 60]
df['Tenure'] = np.random.choice(tenure, 100000)

In [173]:
# Creating EMI based on principle amount, interest rate & tenure

df['EMI'] = ((df['Tenure']/12)*(df['Interest_rate'])+df['Principle_Amount'])/df['Tenure']
df['EMI'] = df['EMI'].round(2)

In [177]:
# creating due date

date = [2, 10, 17, 24]
dates = np.random.choice(date, 100000)
year = []
month= []

for x in df['Date_of_cr']:
  y = x.year
  year.append(y)
  m = x.month
  month.append(m)

duedate = pd.DataFrame(list(zip(year, month, dates)), columns=['year', 'month', 'day'])

df['First_duedate'] = pd.to_datetime(duedate[['year', 'month', 'day']])

In [178]:
for index, row in df.iterrows():
  if row['Tenure'] == 12 and row['First_duedate'].year == 2018:
    y = str(random.choices(range(12), weights=range(13, 1, -1))).strip('[]')
    
print(y)

9

In [179]:
# Tenure remaining
import random

tenure_rem = []
for index, row in df.iterrows():
  if row['Tenure'] == 12 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 12), weights=range(12, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 12 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 12), weights=range(12, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 24 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 24), weights=range(24, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 24 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 24), weights=range(24, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 36 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 36), weights=range(36, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 36 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 36), weights=range(36, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 48 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 48), weights=range(48, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 48 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 48), weights=range(48, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 60 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 60), weights=range(60, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 60 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 60), weights=range(60, 0, -1))).strip('[]')
    tenure_rem.append(y)

df['Tenure_rem'] = tenure_rem
df['Tenure_rem'] = df['Tenure_rem'].astype('int')

In [180]:
# Principle amount remaining

df['Principle_amt_rem'] = df['Principle_Amount'] - (((df['Tenure'] - df['Tenure_rem'])*df['EMI'])*60/100)
df['Principle_amt_rem'] =df['Principle_amt_rem'].round(2)

In [181]:
# Finding last Due date
from datetime import date
from dateutil.relativedelta import relativedelta

last_duedate = []
for index, row in df.iterrows():
  ld = row['First_duedate'] + relativedelta(months=+row['Tenure'])
  last_duedate.append(ld)

df['Last_duedate'] = last_duedate

In [182]:
# Next Duedate
from datetime import datetime

next_duedate = []

for index, row in df.iterrows():
  nd = row['First_duedate'] + relativedelta(months=+(row['Tenure'] - row['Tenure_rem']))
  next_duedate.append(nd)

df['Next_duedate'] = next_duedate

In [183]:
# Loan Status
from datetime import datetime

loanstatus = []

for index, row in df.iterrows():
  if row['Next_duedate'] >= datetime.now() and row['Next_duedate'] <= row['Last_duedate']:
    loanstatus.append('Active')
  elif row['Next_duedate'] < datetime.now() and row['Next_duedate'] < row['Last_duedate']:
    if row['Next_duedate'] >= (datetime.now() - relativedelta(months=+3)) and row['Next_duedate'] < datetime.now():
      loanstatus.append('Collection')
    elif row['Next_duedate'] < (datetime.now() - relativedelta(months=+3)) and row['Next_duedate'] < datetime.now():
      loanstatus.append('Sold')
  elif row['Next_duedate'] <= datetime.now() and row['Next_duedate'] >= row['Last_duedate']:
    loanstatus.append('Paidoff')
  

df['Loan_status'] = loanstatus

In [184]:
df.Loan_status.value_counts()

Active        50318
Sold          39535
Collection     6670
Paidoff        3477
Name: Loan_status, dtype: int64

In [185]:
# Loan Purpose 

purpose = ['Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses']

df['Loan_purpose'] = np.random.choice(purpose, 100000)

In [187]:
df.head()

  Date_of_cr  Customer_id  ... Loan_status        Loan_purpose
0 2018-01-01      1000049  ...        Sold     Medical Expense
1 2018-01-01      1000063  ...        Sold       Bill Payments
2 2018-01-01      1000080  ...        Sold  Emergency Expenses
3 2018-01-01      1000172  ...        Sold        Home Repairs
4 2018-01-01      1000197  ...      Active  Emergency Expenses

[5 rows x 23 columns]

In [189]:
df.columns = ['Date_of_cr', 'Customer_id', 'First_name', 'Last_name', 'Gender',
       'Email', 'Phone', 'Age', 'Occupation', 'Income', 'Marital_status',
       'Principle_Amount', 'Interest_rate', 'Processing_fee', 'Tenure', 'EMI',
       'First_duedate', 'Tenure_rem', 'Principle_amt_rem', 'Last_duedate',
       'Next_duedate', 'Loan_status', 'Loan_purpose']

In [190]:
df.head()

  Date_of_cr  Customer_id  ... Loan_status        Loan_purpose
0 2018-01-01      1000049  ...        Sold     Medical Expense
1 2018-01-01      1000063  ...        Sold       Bill Payments
2 2018-01-01      1000080  ...        Sold  Emergency Expenses
3 2018-01-01      1000172  ...        Sold        Home Repairs
4 2018-01-01      1000197  ...      Active  Emergency Expenses

[5 rows x 23 columns]

In [191]:
df.to_csv('Personal_loan_dataset.csv')